Revit 2024 API
FabricationPart.PlaceFittingAsCutIn Method
 Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public static bool PlaceFittingAsCutIn(
	Document document,
	ElementId straightId,
	ElementId fittingId,
	XYZ position,
	Connector fittingConnector,
	double axisRotation
)
Visual Basic
Public Shared Function PlaceFittingAsCutIn ( _
	document As Document, _
	straightId As ElementId, _
	fittingId As ElementId, _
	position As XYZ, _
	fittingConnector As Connector, _
	axisRotation As Double _
) As Boolean
Visual C++
public:
static bool PlaceFittingAsCutIn(
	Document^ document,
	ElementId^ straightId,
	ElementId^ fittingId,
	XYZ^ position,
	Connector^ fittingConnector,
	double axisRotation
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
straightId
Type: Autodesk.Revit.DB.ElementId
 Identifier of the straight to be cut in.
fittingId
Type: Autodesk.Revit.DB.ElementId
 Identifier of the fitting to cut in.
position
Type: Autodesk.Revit.DB.XYZ
 The position to cut in the straight.
fittingConnector
Type: Autodesk.Revit.DB.Connector
 The connector of the fitting to align with the primary connector of the straight part.
axisRotation
Type: System.Double
 Rotation around the direction of connection - angle between width vectors in radians.
Return Value
 True if cuts in successful.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  For rectangular and oval parts the axis rotation must be a multiple of PI/2. -or- The fitting connector is not a connector of the fitting. -or- The fitting connector is not valid, it is not within a pair connector for cutting in.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Failed to align fitting to the straight to cut in. -or- There is no enough room in the run for cut in.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace